Revit 2024 API
ParameterTypeId.StairsRuntypeHasMonolithicSupport Property
 "Monolithic Support": Monolithic Support
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairsRuntypeHasMonolithicSupport { get; }
Visual Basic
Public Shared ReadOnly Property StairsRuntypeHasMonolithicSupport As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairsRuntypeHasMonolithicSupport {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace